# LinePatternSegment Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinePatternSegment Constructor
LinePatternSegment Class See Also
---
Creates a line pattern segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public LinePatternSegment()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
LinePatternSegment()
```

# See Also
LinePatternSegment Class
LinePatternSegment Overload
Autodesk.Revit.DB Namespace